### KZ SEGMENT ######

KZ_DAY_TIME = "07:00"
KZ_NOON_TIME = "16:00"
KZ_EVENING_TIME = "19:00"


class push_class(dict):
    def __str__(self):
        return json.dumps(self)


KZ_H_MONDAY_MORNING = push_class(
                                    [['en','🎁 Бонус 100% к депозиту 💪'],
]
)


KZ_C_MONDAY_MORNING = push_class(
                                    [['en','Сделай депозит и получи бонус 100%💸 + 70 FREE спинов 🎰 Удача с тобой 🤑'],
]
)


KZ_H_MONDAY_EVENING = push_class(
                                    [['en','🤑 Вечернее безумие 🤑'],
]
)

KZ_C_MONDAY_EVENING = push_class(
                                    [['en','🎰 Шанс джекпота удвоен на 2 часа! 💰 Делай депозит и забери сокровище мумии! 👍'],
]
)

KZ_H_TUESDAY_MORNING = push_class(
                                    [['en','🔥 Это твой шанс на успех! 🔥'],
]
)

KZ_C_TUESDAY_MORNING = push_class(
                                    [['en','👉 Удача уже близко и готова тебя порадовать 🎁'],                                 
]
)

KZ_H_TUESDAY_EVENING = push_class(
                                    [['en','bambaem.islam выиграл джекпот 👍'],
]
)

KZ_C_TUESDAY_EVENING = push_class(
                                    [['en','Только что сорвали джекпот 640 000 тыс. в Book Of Ra. Осталось 3 джекпота! 💵'],                                  
]
)

KZ_H_WEDNESDAY_MORNING = push_class(
                                    [['en','🔥 Скорее регистрируйся! 🔥'],
]
)

KZ_C_WEDNESDAY_MORNING = push_class(
                                    [['en','💥 Только сейчас 100% бонус на первый депозит! 💥'],                                
]
)

KZ_H_WEDNESDAY_EVENING = push_class(
                                    [['en','Вечерний бонус 🎁'],
]
)

KZ_C_WEDNESDAY_EVENING = push_class(
                                    [['en','Шанс джекпота увеличен в 2 раза 💵 Делай депозит и получи 100 фри спинов + 100% к пополнению 😎'],                                 
]
)

KZ_H_THURSDAY_MORNING = push_class(
                                    [['en','Azamat777 сорвал джекпот! 🤑'],
]
)

KZ_C_THURSDAY_MORNING = push_class(
                                    [['en','234 549 тыс. выиграли в игре jammin jarz. Делай депозит и побеждай! 💵'],                             
]
)

KZ_H_THURSDAY_EVENING = push_class(
                                    [['en','🤨 Не успел забрать бонус?'],

]
)

KZ_C_THURSDAY_EVENING = push_class(
                                    [['en','🕔 Осталось 15 минут. Забери бонус 100% к пополнению и 100 FREE СПИНОВ 🎰'],
]
)

KZ_H_FRIDAY_MORNING = push_class(
                                    [['en','💥 Заходим поднимаемся! 🌠'],
]
)

KZ_C_FRIDAY_MORNING = push_class(
                                    [['en','☄️ О да, процент побед сегодня зашкаливает! 💥'],                               
]
)

KZ_H_FRIDAY_EVENING = push_class(
                                    [['en','Magomegov.samir93 выиграл джекпот 🤑'],
]
)

KZ_C_FRIDAY_EVENING = push_class(
                                    [['en','Джекпот 507 768 тыс. выиграли в игре  Book Of Ra! 💵 Забери свой джекпот сейчас! 💸'],                                 
]
)

KZ_H_SATURDAY_MORNING = push_class(
                                    [['en','🔥 Это твой шанс на успех! 🔥'],
]
)

KZ_C_SATURDAY_MORNING = push_class(
                                    [['en','👉 Удача уже близко и готова тебя порадовать 🎁'],                                
]
)

KZ_H_SATURDAY_EVENING = push_class(
                                    [['en','Сейчас максимальный шанс победы 💸'],
]
)

KZ_C_SATURDAY_EVENING = push_class(
                                    [['en','Сделай депозит и получи х2 к пополнению и 100 FREE СПИНОВ 🎁 Удача с тобой 🤑'],
]
)

KZ_H_SUNDAY_MORNING = push_class(
                                    [['en','🍀 Шансы на выигрыш увеличились в 3 раза! 🍀'],
]
)

KZ_C_SUNDAY_MORNING = push_class(
                                    [['en','👉 Заходите, наслаждайтесь и выигрывайте сейчас! 🎰'],                                 
]
)

KZ_H_SUNDAY_EVENING = push_class(
                                    [['en','Rafaello22 сорвал джекпот!  🎰'],
]
)

KZ_C_SUNDAY_EVENING = push_class(
                                    [['en',' 💵 222 549 тыс. выиграли в игре jammin jarz. Делай депозит и побеждай! 💵'],                              
]
)

KZ_H_MONDAY_NOON = push_class(
                                    [['en','Самое время выиграть куш!🤑'],
]
)

KZ_C_MONDAY_NOON = push_class(
                                    [['en','Новые игры и сладкие бонусы уже ждут тебя🔥 Заноси и испытай удачу 💵'],
]
)

KZ_H_TUESDAY_NOON = push_class(
                                    [['en','30 МИНУТ до конца безумия!🔥'],
]
)

KZ_C_TUESDAY_NOON = push_class(
                                    [['en','СРОЧНО! 😱Даем 50 Вращений и бонус к депозиту 100% УЖЕ СЕЙЧАС 😈 Регистрируйся и забирай бонус! 😘'],                                 
]
)

KZ_H_WEDNESDAY_NOON = push_class(
                                    [['en','УМНОЖАЕМ  депозит х2'],
]
)

KZ_C_WEDNESDAY_NOON = push_class(
                                    [['en','Только сегодня УМНОЖИМ 🤑твой депозит В ДВА РАЗА. Яркие победы и новые игры ждут тебя здесь. Регистрируйся быстрее 👍'],                                
]
)

KZ_H_THURSDAY_NOON = push_class(
                                    [['en','Я по тебе скучаю...😘'],
]
)

KZ_C_THURSDAY_NOON = push_class(
                                    [['en','Приходи, я дам тебе 50 Вращений и бонус 100% к депозиту. 😉 Жду. После регистрации ❤️'],                             
]
)

KZ_H_FRIDAY_NOON = push_class(
                                    [['en','Nurbek777 сорвал джекпот💰..'],
]
)

KZ_C_FRIDAY_NOON = push_class(
                                    [['en','125 588 тенге 🇰🇿 в Midas. 👍Заходи и срывай джекпот сейчас! Бонусы уже ждут 👌'],                               
]
)

KZ_H_SATURDAY_NOON = push_class(
                                    [['en','543 540🇰🇿 тенге в … 😈'],
]
)

KZ_C_SATURDAY_NOON = push_class(
                                    [['en','Book of Dead. Удача ждет тебя! 50 Вращений и х2 К ДЕПОЗИТУ🤑 Регистрируйся и поднимай вместе с нами!💰'],                                
]
)

KZ_H_SUNDAY_NOON = push_class(
                                    [['en','🔥 Скорее регистрируйся! 🔥'],
]
)

KZ_C_SUNDAY_NOON = push_class(
                                    [['en','💥 Только сейчас 100% бонус на первый депозит! 💥'],                                 
]
)