### SNG SEGMENT ######

SNG_DAY_TIME = "10:00"
SNG_EVENING_TIME = "19:00"


class push_class(dict):
    def __str__(self):
        return json.dumps(self)


SNG_H_MONDAY_MORNING = push_class(
                                    [['en','🎁 Бонус 100% к депозиту 💪'],
]
)


SNG_C_MONDAY_MORNING = push_class(
                                    [['en','Сделай депозит и получи бонус 100%💸 + 70 FREE спинов 🎰 Удача с тобой 🤑'],
]
)


SNG_H_MONDAY_EVENING = push_class(
                                    [['en','🤑 Вечернее безумие 🤑'],
]
)

SNG_C_MONDAY_EVENING = push_class(
                                    [['en','🎰 Шанс джекпота удвоен на 2 часа! 💰 Делай депозит и забери сокровище мумии! 👍'],
]
)

SNG_H_TUESDAY_MORNING = push_class(
                                    [['en','🔥 Это твой шанс на успех! 🔥'],
]
)

SNG_C_TUESDAY_MORNING = push_class(
                                    [['en','👉 Удача уже близко и готова тебя порадовать 🎁'],                                 
]
)

SNG_H_TUESDAY_EVENING = push_class(
                                    [['en','bambaem.islam выиграл джекпот 👍'],
]
)

SNG_C_TUESDAY_EVENING = push_class(
                                    [['en','Только что сорвали джекпот 640 000 тыс. в Book Of Ra. Осталось 3 джекпота! 💵'],                                  
]
)

SNG_H_WEDNESDAY_MORNING = push_class(
                                    [['en','🔥 Скорее регистрируйся! 🔥'],
]
)

SNG_C_WEDNESDAY_MORNING = push_class(
                                    [['en','💥 Только сейчас 100% бонус на первый депозит! 💥'],                                
]
)

SNG_H_WEDNESDAY_EVENING = push_class(
                                    [['en','Вечерний бонус 🎁'],
]
)

SNG_C_WEDNESDAY_EVENING = push_class(
                                    [['en','Шанс джекпота увеличен в 2 раза 💵 Делай депозит и получи 100 фри спинов + 100% к пополнению 😎'],                                 
]
)

SNG_H_THURSDAY_MORNING = push_class(
                                    [['en','Azamat777 сорвал джекпот! 🤑'],
]
)

SNG_C_THURSDAY_MORNING = push_class(
                                    [['en','234 549 тыс. выиграли в игре jammin jarz. Делай депозит и побеждай! 💵'],                             
]
)

SNG_H_THURSDAY_EVENING = push_class(
                                    [['en','🤨 Не успел забрать бонус?'],

]
)

SNG_C_THURSDAY_EVENING = push_class(
                                    [['en','🕔 Осталось 15 минут. Забери бонус 100% к пополнению и 100 FREE СПИНОВ 🎰'],
]
)

SNG_H_FRIDAY_MORNING = push_class(
                                    [['en','💥 Заходим поднимаемся! 🌠'],
]
)

SNG_C_FRIDAY_MORNING = push_class(
                                    [['en','☄️ О да, процент побед сегодня зашкаливает! 💥'],                               
]
)

SNG_H_FRIDAY_EVENING = push_class(
                                    [['en','Magomegov.samir93 выиграл джекпот 🤑'],
]
)

SNG_C_FRIDAY_EVENING = push_class(
                                    [['en','Джекпот 507 768 тыс. выиграли в игре  Book Of Ra! 💵 Забери свой джекпот сейчас! 💸'],                                 
]
)

SNG_H_SATURDAY_MORNING = push_class(
                                    [['en','🔥 Это твой шанс на успех! 🔥'],
]
)

SNG_C_SATURDAY_MORNING = push_class(
                                    [['en','👉 Удача уже близко и готова тебя порадовать 🎁'],                                
]
)

SNG_H_SATURDAY_EVENING = push_class(
                                    [['en','Сейчас максимальный шанс победы 💸'],
]
)

SNG_C_SATURDAY_EVENING = push_class(
                                    [['en','Сделай депозит и получи х2 к пополнению и 100 FREE СПИНОВ 🎁 Удача с тобой 🤑'],
]
)

SNG_H_SUNDAY_MORNING = push_class(
                                    [['en','🍀 Шансы на выигрыш увеличились в 3 раза! 🍀'],
]
)

SNG_C_SUNDAY_MORNING = push_class(
                                    [['en','👉 Заходите, наслаждайтесь и выигрывайте сейчас! 🎰'],                                 
]
)

SNG_H_SUNDAY_EVENING = push_class(
                                    [['en','Rafaello22 сорвал джекпот!  🎰'],
]
)

SNG_C_SUNDAY_EVENING = push_class(
                                    [['en',' 💵 222 549 тыс. выиграли в игре jammin jarz. Делай депозит и побеждай! 💵'],                              
]
)